[
  {
    "slug": "monitor-barn",
    "title": "Monitor Barn",
    "location": "Martha's Vineyard, MA",
    "description": "This barn was designed for a tradesman on Martha's Vineyard who, after recently starting a family, needed a shop space that was both highly functional and beautiful. The intent was to create a workspace that could serve his business while maintaining the flexibility to partially convert into an accessory dwelling unit in the future. This dual-use concept guided many of the early decisions, as natural light, ventilation, and spatial hierarchy had to support both modes of use.\n\nThe building takes its cues from the traditional monitor barn—long a staple of agricultural structures—but adapted the to a contemporary island context. The raised monitor volume introduces light into the center of the plan, while the south-facing side opens into a covered portico, providing shaded outdoor work area and weather protection for material handling.\n\nSite and regulatory constraints dictated that the footprint not exceed 36' x 36'. Working within that boundary, the plan was organized to accommodate both a functional workshop layout and a future living configuration without inflating the envelope. The structure itself reflects this logic as well: the building is stick framed and built on a 6\" slab-on-grade with a thickened edge. The portico is framed using a box-beam design for strength and visual lightness, while the monitor employs a cantilever detail to minimize visible vertical supports and preserve the interior clearance needed for equipment and tool workflows.\n\nTogether, these decisions produced a building that feels grounded in the practical realities of a working tradesman's life—durable, adaptable, flexible, and understated—while still offering the possibility of domesticity and warmth in the years ahead.",
    "splatUrl": "/splat/monitor-barn.splat",
    "fallbackMediaUrl": "/images/monitor-barn-zoom-out.png",
    "plans": [
      {
        "type": "pdf",
        "src": "/plans/monitor.pdf",
        "page": 1,
        "label": "Floor Plan"
      },
      {
        "type": "pdf",
        "src": "/plans/monitor barn section_49runner.tif.pdf",
        "page": 1,
        "label": "Section"
      }
    ]
  },
  {
    "slug": "post-and-beam-residence",
    "title": "Post & Beam Residence",
    "location": "Martha's Vineyard, MA",
    "description": "Designed by a post-and-beam framer on Martha's Vineyard, this project pairs a classic New England cape with traditional timber frame construction while incorporating contemporary building systems. Structural insulated panels (SIPs) form the enclosure and provide high thermal performance, energy efficiency, and ease of installation on a coastal site.\n\nSeveral constraints shaped the building's form and organization. Budget and zoning limitations influenced both the footprint and overall height, resulting in a compact two-story building that maintains a time-honored profile. These parameters prompted design decisions to maximize spatial efficiency, including a winding staircase that conserves interior square footage without compromising circulation.\n\nThe post and beam construction dictated specific load paths within the building, requiring careful placement and coordination of bearing elements relative to the layout. The models and documentation produced supported the resolution of these conditions, ensuring compatibility between the timber frame, SIP enclosure, and interior program.\n\nThe result is a house that aligns traditional craft with modern building science—marrying familiar regional character with improved performance, longevity, and constructability.",
    "splatUrl": "/splat/post-and-beam-residence.splat",
    "fallbackMediaUrl": "/images/post-and-beam.png",
    "plans": [
      {
        "type": "pdf",
        "src": "/plans/post and beam main floor plan.pdf",
        "page": 1,
        "label": "Main Floor Plan"
      },
      {
        "type": "pdf",
        "src": "/plans/post and beam basement_plan.pdf",
        "page": 1,
        "label": "Basement Plan"
      },
      {
        "type": "pdf",
        "src": "/plans/post and beam detail.pdf",
        "page": 1,
        "label": "Detail"
      }
    ]
  },
  {
    "slug": "contemporary-farm-house",
    "title": "Contemporary Farm House",
    "location": "Stowe, VT",
    "description": "This modern farmhouse proposal adapts classic Vermont agricultural forms to contemporary residential use. Traditional barn-inspired massing is combined with modern elements including expansive glazing, a standing-seam metal roof, and a generous elevated deck that frames views toward the surrounding landscape.\n\nThe 2,400 square foot design includes three bedrooms, two and a half baths, a large garage/workshop, a game room, and a home spa with sauna. The interior configuration supports both family living and recreational use, with workshop and storage functions located at grade and primary living spaces oriented to capture natural light and views of the Green Mountains.\n\nThe structural system pairs an insulated concrete form (ICF) foundation and first-story walls with conventional stick framing above, providing enhanced energy performance, durability, and improved constructability in a cold-climate region. Large window groupings and wide door openings introduce light and openness while maintaining the proportions and simplicity associated with New England farm structures.\n\nDigital modeling and planning studies supported the design effort, enabling visualization of massing, glazing strategies, and interior layouts prior to full construction documentation. Although the project did not proceed to permitting, the resulting material demonstrates how traditional regional forms can integrate with contemporary building systems and amenities.",
    "splatUrl": "/splat/contemporary-farm-house.splat",
    "fallbackMediaUrl": "/images/contemporary-farm.png",
    "plans": [
      {
        "type": "pdf",
        "src": "/plans/contemporary farm-1.pdf",
        "page": 1,
        "label": "Floor Plans"
      },
      {
        "type": "pdf",
        "src": "/plans/contemporary farm-2.pdf",
        "page": 1,
        "label": "Elevations"
      }
    ]
  },
  {
    "slug": "garage",
    "title": "Garage",
    "location": "Stowe, VT",
    "description": "Located in Stowe, Vermont this garage was designed to reference regional farm and outbuilding forms while accommodating a modern double vehicle bay and future residential use above. A simple gable form, vertical siding, and limited detailing keep the structure consistent with local agrarian building traditions while larger openings and contemporary garage doors introduce a more modern expression.\n\nThe plan includes a two-bay ground-level garage and an unfinished upper level planned for future conversion into a small studio. The structural design supports this flexibility: a 16\" engineered Microllam LVL beam spans the full garage door width to maintain a wide opening and a 16\" TJI 560 floor system provides a clear span without interior posts or beams. This approach preserves usable floor area at the ground level and simplifies future planning for the upper space.\n\nThe result is a building that balances functional demands with familiar regional forms—simple, adaptable, and built to accommodate both current use and future possibilities.",
    "splatUrl": "/splat/garage.splat",
    "fallbackMediaUrl": "/images/garage.png",
    "plans": [
      {
        "type": "pdf",
        "src": "/plans/garage main floor.pdf",
        "page": 1,
        "label": "Main Floor"
      },
      {
        "type": "pdf",
        "src": "/plans/garage section1.pdf",
        "page": 1,
        "label": "Section"
      },
      {
        "type": "pdf",
        "src": "/plans/garage.pdf",
        "page": 1,
        "label": "Plans & Elevations"
      }
    ]
  },
  {
    "slug": "details",
    "title": "Details",
    "location": "",
    "description": "Clear detailing in architectural and structural drawings is critical to ensuring that design intent becomes buildable. Good details communicate how materials and systems integrate, how loads transfer, and how weather is managed—reducing ambiguity in the field and minimizing mistakes.",
    "splatUrl": null,
    "fallbackMediaUrl": null,
    "plans": [
      {
        "type": "pdf",
        "src": "/plans/post and beam detail.pdf",
        "page": 1,
        "label": "Details"
      }
    ]
  }
]
